In [1]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
                'Grades':['AA','AB','AA','AB','AC','BA','BB']
               }
df1=pd.DataFrame(dict1,index=['stu1','stu2','stu3','stu4','stu5',
                             'stu6','stu7'])
df1

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

# Students having marks greater than 90

In [3]:
df1[df1['Marks']>90]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

# students having AB Grade

In [4]:
df1

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

In [7]:
df1[df1['Grades']=='AB']

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

# Student having marks greater than 90 and have grade AB grade

In [15]:
df1[(df1['Marks']>80)& (df1['Grades']=='AB')]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

# name of the student who are grater then 90

In [19]:
df1[df1['Marks']>90]['Name']

stu1    Priyang
stu3     Krisha
Name: Name, dtype: object

# name of the student having AB Grade

In [21]:
df1[df1['Grades']=='AB']['Name']

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object

# Students having marks greater than 90

In [22]:
df1.loc[df1['Marks']>90]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

# students having AB Grade

In [23]:
df1.loc[df1['Grades']=='AB']

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

# Student having marks greater than 90 and have grade AB grade

In [26]:
df1.loc[(df1['Marks']>80) & (df1['Grades']=='AB')]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

# name of the student who are grater then 90

In [27]:
df1.loc[df1['Marks']>90]['Name']

stu1    Priyang
stu3     Krisha
Name: Name, dtype: object

# name of the student having AB Grade

In [32]:
df1.loc[df1['Grades']=='AB']['Name']

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object

# Students having marks greater than 90Â¶

In [29]:
df1[df1.iloc[:,1]>90]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

# students having AB Grade

In [33]:
df1[df1.iloc[:,2]=='AB']

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

# Student having marks greater than 90 and have grade AB grade

In [35]:
df1[(df1.iloc[:,1]>80) & (df1.iloc[:,2]=='AB')]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

# name of the student who are grater then 90

In [36]:
df1[df1.iloc[:,1]>90]['Name']

stu1    Priyang
stu3     Krisha
Name: Name, dtype: object

# Name of the student who are having grdes AB

In [37]:
df1[df1.iloc[:,2]=='AB']['Name']

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object